УТ_для_edt/src/InformationRegisters/смартИсторияКонтактнойИнформацииПользователей/смартИсторияКонтактнойИнформацииПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИсторияКонтактнойИнформацииПользователей</name>
  <comment>#1651 смарт: Лопато 22.02.2024 //Телефония. Хранение истории контактной информации пользователей</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерТелефонаБезКодов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартИсторияКонтактнойИнформацииПользователей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//++#1651 смарт: Лопато 25.03.2024 //Телефония. Хранение истории контактной информации пользователей  
Процедура ЗаписатьИсториюКонтактнойИнформацииПользователя(ОбъектСсылка, ТаблицаКонтактнойИнформации) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ДатаИстории = ТекущаяДата(); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Владелец",  ОбъектСсылка);
	Запрос.УстановитьПараметр("Период",    ДатаИстории);
	Запрос.УстановитьПараметр("ТаблицаКИ", ТаблицаКонтактнойИнформации);
	Запрос.УстановитьПараметр("ТипКИ",	   Перечисления.ТипыКонтактнойИнформации.Телефон);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Период КАК Период,
	|	&Владелец КАК Владелец,
	|	ТаблицаКИ.Тип КАК Тип,
	|	ТаблицаКИ.Вид КАК Вид,
	|	ТаблицаКИ.ЗначенияПолей КАК ЗначенияПолей,
	|	ТаблицаКИ.НомерТелефона КАК НомерТелефона,
	|	ТаблицаКИ.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	ТаблицаКИ.Представление КАК Представление,
	|	ТаблицаКИ.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
	|ИЗ
	|	&ТаблицаКИ КАК ТаблицаКИ
	|ГДЕ
	|	ТаблицаКИ.Тип = &ТипКИ
	|	И ТаблицаКИ.НомерТелефона <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияКИ.Период КАК Период,
	|	ИсторияКИ.Владелец КАК Владелец,
	|	ИсторияКИ.Тип КАК Тип,
	|	ИсторияКИ.Вид КАК Вид,
	|	ИсторияКИ.Представление КАК Представление,
	|	ИсторияКИ.ЗначенияПолей КАК ЗначенияПолей,
	|	ИсторияКИ.НомерТелефона КАК НомерТелефона,
	|	ИсторияКИ.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	ИсторияКИ.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ИсторияКИ
	|ИЗ
	|	РегистрСведений.смартИсторияКонтактнойИнформацииПользователей.СрезПоследних(
	|			&Период,
	|			Владелец = &Владелец
	|				И Тип = &ТипКИ) КАК ИсторияКИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Период,
	|	Владелец,
	|	Тип,
	|	Вид,
	|	ЗначенияПолей,
	|	НомерТелефона,
	|	НомерТелефонаБезКодов,
	|	Представление,
	|	Значение
	|ИЗ
	|	ВТ_КонтактнаяИнформация
	|ГДЕ
	|	НЕ (Владелец, Тип, Вид, ВЫРАЗИТЬ(ЗначенияПолей КАК СТРОКА(1000)), НомерТелефона, НомерТелефонаБезКодов, Представление, ВЫРАЗИТЬ(Значение КАК СТРОКА(1000))) 
	|		В (ВЫБРАТЬ 
	|		      Владелец, Тип, Вид, ВЫРАЗИТЬ(ЗначенияПолей КАК СТРОКА(1000)), НомерТелефона, НомерТелефонаБезКодов, Представление, ВЫРАЗИТЬ(Значение КАК СТРОКА(1000))
	|		   ИЗ 
	|		      ВТ_ИсторияКИ)";
	
	ВыборкаКИ = Запрос.Выполнить().Выбрать();

	Пока ВыборкаКИ.Следующий() Цикл
		
		МенеджерЗаписиКИ = РегистрыСведений.смартИсторияКонтактнойИнформацииПользователей.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиКИ, ВыборкаКИ);		
		
		МенеджерЗаписиКИ.Записать();
		
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //--#1651 смарт: Лопато 25.03.2024

#КонецОбласти

#КонецЕсли
